export const ICONS = {
  discourse: '<svg xmlns="http://www.w3.org/2000/svg" width="32" height="32" viewBox="0 0 32 32"><path fill="currentColor" d="M16.135 0C24.885 0 32 7.313 32 15.995s-7.104 15.99-15.865 15.99L0 32.001V15.72C0 7.043 7.375.001 16.135.001zm.157 6.083a9.851 9.851 0 0 0-8.448 4.76a9.655 9.655 0 0 0-.198 9.625l-1.781 5.677l6.396-1.432a9.889 9.889 0 0 0 10.844-1.854a9.662 9.662 0 0 0 2.318-10.661a9.835 9.835 0 0 0-9.12-6.115z"/></svg>',
  gitee: '<?xml version="1.0" standalone="no"?><!DOCTYPE svg PUBLIC "-//W3C//DTD SVG 1.1//EN" "http://www.w3.org/Graphics/SVG/1.1/DTD/svg11.dtd"><svg t="1668434078511" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2734" xmlns:xlink="http://www.w3.org/1999/xlink" width="200" height="200"><path d="M512 1024C230.4 1024 0 793.6 0 512S230.4 0 512 0s512 230.4 512 512-230.4 512-512 512z m259.2-569.6H480c-12.8 0-25.6 12.8-25.6 25.6v64c0 12.8 12.8 25.6 25.6 25.6h176c12.8 0 25.6 12.8 25.6 25.6v12.8c0 41.6-35.2 76.8-76.8 76.8h-240c-12.8 0-25.6-12.8-25.6-25.6V416c0-41.6 35.2-76.8 76.8-76.8h355.2c12.8 0 25.6-12.8 25.6-25.6v-64c0-12.8-12.8-25.6-25.6-25.6H416c-105.6 0-188.8 86.4-188.8 188.8V768c0 12.8 12.8 25.6 25.6 25.6h374.4c92.8 0 169.6-76.8 169.6-169.6v-144c0-12.8-12.8-25.6-25.6-25.6z" p-id="2735"></path></svg>',
  oschina: '<svg t="1669908932648" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1600" width="200" height="200"><path d="M518.4 691.2c-99.2 0-182.4-64-185.6-185.6-6.4-112 92.8-188.8 188.8-192 108.8-3.2 176 121.6 176 121.6l281.6-102.4S864 32 547.2 32C252.8 35.2 48 236.8 48 512c0 243.2 192 489.6 489.6 476.8C867.2 976 979.2 688 979.2 688L688 592c3.2 3.2-57.6 99.2-169.6 99.2" p-id="1601"></path></svg>',
  gitcode: '<svg width="24" height="24" class="icon" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg"><path fill-rule="evenodd" clip-rule="evenodd" d="M15.4791 4.97677C15.6201 4.89789 15.7691 4.8145 15.93 4.72314C15.9494 4.82848 15.9683 4.92046 15.9854 5.00383C16.0157 5.15091 16.0406 5.2719 16.0525 5.39144C16.1479 6.4296 16.6697 7.1933 17.4092 7.36527C18.4908 7.61639 19.5106 7.20133 20.06 6.28555C20.72 5.18673 20.4334 3.84099 19.3097 3.03098C16.1851 0.777435 12.7523 0.155888 9.05448 1.24127C1.08137 3.59371 -1.64675 13.3884 4.01196 19.3949C6.43291 21.9642 9.50695 23.0727 12.9963 22.9889C17.4663 22.8839 20.6857 20.6563 22.7408 16.7954C24.1978 14.0561 22.6139 11.0619 19.5805 10.4396C17.8481 10.0908 16.0765 9.97756 14.3137 10.103C13.7272 10.1594 13.1579 10.3325 12.6394 10.6124C12.0592 10.9135 11.8915 11.5383 11.9565 12.1575C12.0171 12.7217 12.4498 13.0601 12.965 13.1453C14.0024 13.3077 15.0522 13.402 16.1 13.4881C16.4032 13.5136 16.7093 13.5166 17.0149 13.5197C17.4534 13.5241 17.8912 13.5285 18.3187 13.5991C19.5385 13.8007 19.9574 14.7905 19.33 15.8495C19.1763 16.1041 18.9971 16.3424 18.7951 16.5607C17.9745 17.4632 16.9014 18.0981 15.7152 18.3827C13.55 18.9127 11.3827 18.9425 9.22755 18.2617C6.77347 17.4875 5.31042 15.6849 5.25902 13.2584C5.2398 11.7619 5.61972 10.2874 6.35969 8.9865C6.694 8.38013 6.87751 7.75562 6.82593 7.06851C6.80422 6.77557 6.79219 6.48231 6.77927 6.16716C6.77239 5.99944 6.76526 5.82551 6.75628 5.64214C7.00484 5.69431 7.25032 5.76016 7.49161 5.83943C8.43027 6.21622 9.35415 6.38811 10.3702 6.11155C10.9481 5.97335 11.5455 5.93511 12.1363 5.9985C13.0877 6.07606 14.0387 5.84361 14.847 5.33586C15.0488 5.2176 15.2539 5.10279 15.4791 4.97677Z" fill="currentColor"/></svg>',
  gitea: '<svg xmlns="http://www.w3.org/2000/svg" xml:space="preserve" viewBox="0 0 640 640" width="32" height="32"><path d="m395.9 484.2-126.9-61c-12.5-6-17.9-21.2-11.8-33.8l61-126.9c6-12.5 21.2-17.9 33.8-11.8 17.2 8.3 27.1 13 27.1 13l-.1-109.2 16.7-.1.1 117.1s57.4 24.2 83.1 40.1c3.7 2.3 10.2 6.8 12.9 14.4 2.1 6.1 2 13.1-1 19.3l-61 126.9c-6.2 12.7-21.4 18.1-33.9 12" style="fill:#fff"/><path d="M622.7 149.8c-4.1-4.1-9.6-4-9.6-4s-117.2 6.6-177.9 8c-13.3.3-26.5.6-39.6.7v117.2c-5.5-2.6-11.1-5.3-16.6-7.9 0-36.4-.1-109.2-.1-109.2-29 .4-89.2-2.2-89.2-2.2s-141.4-7.1-156.8-8.5c-9.8-.6-22.5-2.1-39 1.5-8.7 1.8-33.5 7.4-53.8 26.9C-4.9 212.4 6.6 276.2 8 285.8c1.7 11.7 6.9 44.2 31.7 72.5 45.8 56.1 144.4 54.8 144.4 54.8s12.1 28.9 30.6 55.5c25 33.1 50.7 58.9 75.7 62 63 0 188.9-.1 188.9-.1s12 .1 28.3-10.3c14-8.5 26.5-23.4 26.5-23.4S547 483 565 451.5c5.5-9.7 10.1-19.1 14.1-28 0 0 55.2-117.1 55.2-231.1-1.1-34.5-9.6-40.6-11.6-42.6M125.6 353.9c-25.9-8.5-36.9-18.7-36.9-18.7S69.6 321.8 60 295.4c-16.5-44.2-1.4-71.2-1.4-71.2s8.4-22.5 38.5-30c13.8-3.7 31-3.1 31-3.1s7.1 59.4 15.7 94.2c7.2 29.2 24.8 77.7 24.8 77.7s-26.1-3.1-43-9.1m300.3 107.6s-6.1 14.5-19.6 15.4c-5.8.4-10.3-1.2-10.3-1.2s-.3-.1-5.3-2.1l-112.9-55s-10.9-5.7-12.8-15.6c-2.2-8.1 2.7-18.1 2.7-18.1L322 273s4.8-9.7 12.2-13c.6-.3 2.3-1 4.5-1.5 8.1-2.1 18 2.8 18 2.8L467.4 315s12.6 5.7 15.3 16.2c1.9 7.4-.5 14-1.8 17.2-6.3 15.4-55 113.1-55 113.1" style="fill:currentColor"/><path d="M326.8 380.1c-8.2.1-15.4 5.8-17.3 13.8s2 16.3 9.1 20c7.7 4 17.5 1.8 22.7-5.4 5.1-7.1 4.3-16.9-1.8-23.1l24-49.1c1.5.1 3.7.2 6.2-.5 4.1-.9 7.1-3.6 7.1-3.6 4.2 1.8 8.6 3.8 13.2 6.1 4.8 2.4 9.3 4.9 13.4 7.3.9.5 1.8 1.1 2.8 1.9 1.6 1.3 3.4 3.1 4.7 5.5 1.9 5.5-1.9 14.9-1.9 14.9-2.3 7.6-18.4 40.6-18.4 40.6-8.1-.2-15.3 5-17.7 12.5-2.6 8.1 1.1 17.3 8.9 21.3s17.4 1.7 22.5-5.3c5-6.8 4.6-16.3-1.1-22.6 1.9-3.7 3.7-7.4 5.6-11.3 5-10.4 13.5-30.4 13.5-30.4.9-1.7 5.7-10.3 2.7-21.3-2.5-11.4-12.6-16.7-12.6-16.7-12.2-7.9-29.2-15.2-29.2-15.2s0-4.1-1.1-7.1c-1.1-3.1-2.8-5.1-3.9-6.3 4.7-9.7 9.4-19.3 14.1-29-4.1-2-8.1-4-12.2-6.1-4.8 9.8-9.7 19.7-14.5 29.5-6.7-.1-12.9 3.5-16.1 9.4-3.4 6.3-2.7 14.1 1.9 19.8z" style="fill:currentColor"/></svg>',
}

export const CONTRIBUTORS = [
  { name: '柴树杉', points: 86000 },
  { name: '丁尔男', points: 90500 },
  { name: '史斌', points: 29000 },
  { name: '扈梦明', points: 49000 },
  { name: '赵普明', points: 18000 },
  { name: '宋汝阳', points: 2000 },
  { name: '刘云峰', points: 1000 },
  { name: '王湘南', points: 1000 },
  { name: '王泽龙', points: 1000 },
  { name: '吴烜', points: 3000 },
  { name: '刘斌', points: 2500 },
  { name: '尹贻浩', points: 2000 },
  { name: '安博超', points: 3000 },
  { name: 'yuqiaoyu', points: 600 },
  { name: 'qstesiro', points: 200 },
  { name: 'small_broken_gong', points: 100 },
  { name: 'tk103331', points: 100 },
  { name: '蔡兴', points: 3000 },
  { name: '王仁义', points: 1000 },
  { name: 'imalasong', points: 1000 },
  { name: '杨刚', points: 4000 },
  { name: '崔爽', points: 2000 },
]

export const COMMUNITIES = [
  { name: '𝕏', logoName: 'x.png', link: 'https://twitter.com/wayuyan' },
  { name: 'B站', logoName: 'bilibili.png', link: 'https://space.bilibili.com/344260496' },
  { name: '知乎', logoName: 'zhihu.svg', link: 'https://www.zhihu.com/question/570351019' },
  { name: '开源中国', logoName: 'oschina.png', link: 'https://my.oschina.net/walang' },
]

export const DEMOS = [
  { name: 'Playground', logoName: 'wa.png', link: 'https://wa-lang.org/playground/' },
  { name: '贪吃蛇', logoName: 'wa.png', link: 'https://wa-lang.org/wa/snake/' },
  { name: '贪吃蛇(WASM4)', logoName: 'wa.png', link: 'https://wa-lang.org/wa/w4-snake/' },
  { name: '生命游戏(WASM4)', logoName: 'wa.png', link: 'https://wa-lang.org/wa/w4-life/' },
  { name: '2048游戏', logoName: 'wa.png', link: 'https://wa-lang.org/wa/w4-2048/' },
  { name: '俄罗斯方块', logoName: 'wa.png', link: 'https://wa-lang.org/wa/w4-tetris/' },
  { name: '井字游戏', logoName: 'wa.png', link: 'https://wa-lang.org/wa/w4-tic-tac-toe/' },
  { name: '乒乓球', logoName: 'wa.png', link: 'https://wa-lang.org/wa/w4-pong/' },
  { name: '小火箭', logoName: 'wa.png', link: 'https://wa-lang.org/wa/w4-rocket/' },
  { name: '放大镜(WASM4)', logoName: 'wa.png', link: 'https://wa-lang.org/wa/w4-magnifying-glass/' },
  { name: 'NES emulator', logoName: 'wa.png', link: 'https://wa-lang.org/nes/' },
  { name: 'WebGPU', logoName: 'wa.png', link: 'https://wa-lang.org/webgpu/' },
  { name: '放大镜', logoName: 'wa.png', link: 'https://wa-lang.org/examples/magnifying-glass/' },
  { name: '生命游戏', logoName: 'wa.png', link: 'https://wa-lang.org/examples/life/' },
  { name: '分型', logoName: 'wa.png', link: 'https://wa-lang.org/examples/mandelbrot/' },
  { name: 'QRCode', logoName: 'wa.png', link: 'https://wa-lang.org/examples/qrcode/' },
  { name: 'Brainfuck', logoName: 'wa.png', link: 'https://wa-lang.org/wa/brainfuck/' },
  { name: 'Dora-SSR', logoName: 'wa.png', link: 'https://github.com/IppClub/dora-wa' },
]

export const FRIENDLY_LINK = [
  { name: 'PLOC', logoName: 'ploc-logo.svg', link: 'https://ploc.org.cn/' },
  { name: '洛书', logoName: 'losu.png', link: 'https://losu.tech/' },
  { name: 'Dora SSR', logoName: 'dora.svg', link: 'https://dora-ssr.net/' },
]

export const NAV_BANNER = {
  title: '🎉 使用凹语言开发Dora SSR游戏 🎉',
  link: 'https://wa-lang.org/smalltalk/st0067.html',
}
